Revit 2026 API

# LightTypeSetInitialIntensity Method

---

Replace the current initial intensity object with the given object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetInitialIntensity(
	InitialIntensity initialIntensity
)
```
```vb
Public Sub SetInitialIntensity (
	initialIntensity As InitialIntensity
)
```
```cpp
public:
void SetInitialIntensity(
	InitialIntensity^ initialIntensity
)
```
```fsharp
member SetInitialIntensity :
        initialIntensity : InitialIntensity -> unit
```

#### Parameters

initialIntensity InitialIntensity
     An object derived from an InitialIntensity object

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The argument object is cloned

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace